# Practice
 you will practice using Pandas and how to manipulate data to turn it into useful information.
 - you can download needed data from here, [PracticeData](https://drive.google.com/file/d/1OHgvLPNZsjcyGZafx-U-fbtkLS8JiGkz/view?usp=sharing), [PracticeGrades](https://drive.google.com/file/d/1BycpsXykKRNWyKYubHkDapF2UNpz3Uun/view?usp=sharing)
 - you can download session notebooks from here , [Part1](https://drive.google.com/file/d/1HujHwkv0_qXrfyppEnD6XRYS8laYMPgI/view?usp=sharing) , [Part2](https://drive.google.com/file/d/10TZlMlfdjeDn0_ZS7dbOr4m38dnNTZYn/view?usp=sharing)

### 1. Import libraries and data frames
- here you need to import `pandas` and `numpy` libraries to use them.
- then, import needed datasets, `PracticeData` and `PracticeGrades`
and assign them with understandable names.

In [12]:
import pandas as pd
import numpy as np

In [18]:
PracticeData=pd.read_csv(r"C:\Users\Marina\Downloads\PracticeData (1).csv")
PracticeData.head()

,ID,gender,race/ethnicity,parental level of education,lunch,test preparation course
0,20424,female,group B,bachelor's degree,standard,none
1,22965,female,group C,some college,standard,completed
2,21822,female,group B,master's degree,standard,none
3,22231,male,group A,associate's degree,free/reduced,none
4,20627,male,group C,some college,Standard,none

In [19]:
PracticeGrades=pd.read_csv(r"C:\Users\Marina\Downloads\PracticeGrades (1).csv")
PracticeGrades.head()

      ID  math score reading score writing score
0  20424        72.0            72            74
1  22965        69.0            90            88
2  21822        90.0            95            93
3  22231        47.0            57            44
4  20627        76.0            78            75

### 2. Concatenate teams into one DataFrame
- join `PracticeData` and `PracticeGrades` and clean dataframe.

In [22]:
Practice=pd.merge(PracticeData,PracticeGrades)
Practice.head()

,ID,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,20424,female,group B,bachelor's degree,standard,none,72.0,72,74
1,22965,female,group C,some college,standard,completed,69.0,90,88
2,21822,female,group B,master's degree,standard,none,90.0,95,93
3,22231,male,group A,associate's degree,free/reduced,none,47.0,57,44
4,20627,male,group C,some college,Standard,none,76.0,78,75

### 3. Exploratory DataAnalysis & Define Problems ;)
- hint: start with `info()` and `isnull()` to find the problems need to be solved.
- you have problems in this data, you need to find them out and solve them to make a clean dataset.
- don't use `dropna()` to solve null values problems.

In [36]:
Practice.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   ID                           1000 non-null   int64
 1   gender                       1000 non-null   object
 2   race/ethnicity               1000 non-null   object
 3   parental level of education  1000 non-null   object
 4   lunch                        1000 non-null   object
 5   test preparation course      1000 non-null   object
 6   math score                   1000 non-null   float64
 7   reading score                1000 non-null   object
 8   writing score                1000 non-null   object
dtypes: float64(1), int64(1), object(7)
memory usage: 78.1+ KB

In [25]:
Practice.isnull().sum()

ID                             0
gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     8
reading score                  0
writing score                  0
dtype: int64

In [27]:
x=Practice['math score'].mean()

In [31]:
Practice['math score'].fillna(x,inplace=True)

In [32]:
Practice.isnull().sum()

ID                             0
gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [33]:
Practice['gender'].unique()

array(['female', 'male', 'f', 'm'], dtype=object)

In [41]:
Practice['gender']=Practice['gender'].replace("f","female")
Practice['gender']=Practice['gender'].replace("m","male")

In [45]:
Practice['race/ethnicity'].unique()

array(['group B', 'group C', 'group A', 'group D', 'group E', 'group c',
       'group d'], dtype=object)

In [48]:
Practice['race/ethnicity']=Practice['race/ethnicity'].str.lower()

In [49]:
Practice['race/ethnicity'].unique()

array(['group b', 'group c', 'group a', 'group d', 'group e'],
      dtype=object)

In [50]:
Practice['reading score'].unique()

array(['72', '90', '95', '57', '78', '83', '43', '64', '60', '54', '52',
       '81', '53', '75', '89', '32', '42', '58', '69', '73', '71', '74',
       '70', '65', '87', '56', '61', '84', '55', '44', '41', '85', '59',
       '17', '39', '80', '37', '63', '51', '49', '26', '68', '45', '47',
       '86', '34', '79', '66', '67', '91', '100', '76', '77', '82', '92',
       '93', '-', '62', '88', '50', '28', '..', '48', '46', '23', '38',
       '94', '97', '99', '31', '96', '24', '29', '40'], dtype=object)

In [60]:
Practice['reading score']=Practice['reading score'].replace("-",np.nan)
Practice['reading score']=Practice['reading score'].replace("..",np.nan)
Practice['reading score']=Practice['reading score'].astype(float)

In [63]:
x=Practice['reading score'].mean()
Practice['reading score']=Practice['reading score'].fillna(x)
Practice.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   ID                           1000 non-null   int64
 1   gender                       1000 non-null   object
 2   race/ethnicity               1000 non-null   object
 3   parental level of education  1000 non-null   object
 4   lunch                        1000 non-null   object
 5   test preparation course      1000 non-null   object
 6   math score                   1000 non-null   float64
 7   reading score                1000 non-null   float64
 8   writing score                1000 non-null   object
dtypes: float64(2), int64(1), object(6)
memory usage: 78.1+ KB

In [64]:
Practice['writing score'].unique()

array(['74', '88', '93', '44', '75', '78', '92', '39', '67', '50', '52',
       '43', '73', '70', '58', '86', '28', '46', '61', '63', '53', '80',
       '72', '55', '65', '38', '82', '79', '83', '59', '57', '54', '68',
       '66', '62', '76', '48', '42', '87', '49', '10', '34', '71', '37',
       '56', '41', '22', '81', '45', '36', '89', '47', '90', '100', '64',
       '98', '51', '40', '84', '69', '33', '60', '85', '91', '77', '27',
       '94', '95', '60%', '69%', '19', '35', '32', '96', '97', '99', '15',
       '30', '23'], dtype=object)

In [68]:
Practice['writing score']=Practice['writing score'].str.replace("%","")
Practice['writing score']=Practice['writing score'].astype(float)

In [69]:
Practice.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   ID                           1000 non-null   int64
 1   gender                       1000 non-null   object
 2   race/ethnicity               1000 non-null   object
 3   parental level of education  1000 non-null   object
 4   lunch                        1000 non-null   object
 5   test preparation course      1000 non-null   object
 6   math score                   1000 non-null   float64
 7   reading score                1000 non-null   float64
 8   writing score                1000 non-null   float64
dtypes: float64(3), int64(1), object(5)
memory usage: 78.1+ KB

### 4. Task 
- required: ID of highest `writing score`
- required: ID of highest `reading score`
- required: ID of highest `math score`

In [70]:
Practice.sort_values(by=["writing score"],ascending=False)

,ID,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
179,24575,female,group d,some high school,standard,completed,97.0,100.0,100.0
114,24250,female,group e,bachelor's degree,standard,completed,99.0,100.0,100.0
903,24871,female,group d,bachelor's degree,free/reduced,completed,93.0,100.0,100.0
403,22534,female,group d,high school,standard,completed,88.0,99.0,100.0
458,20288,female,group e,bachelor's degree,standard,none,100.0,100.0,100.0
...,...,...,...,...,...,...,...,...,...
980,21677,female,group b,high school,free/reduced,none,8.0,24.0,23.0
76,23493,male,group e,some high school,standard,none,30.0,26.0,22.0
327,21378,male,group a,some college,free/reduced,none,28.0,23.0,19.0
596,24404,male,group b,high school,free/reduced,none,30.0,24.0,15.0
59,24734,female,group c,some high school,free/reduced,none,0.0,17.0,10.0

### 5. **EXIT TICKET ;)** 
- Create `total` column (sum of scores)
- Create  `grade` column (F, D, C, B, A)